
/* AppController */
"BetterZip will only run on macOS 10.10 (Yosemite) or later systems." = "BetterZip funkar bara på macOS 10.10 (Yosemite) eller senare.";
"Quit!" = "Stäng av!";
"Sorry!" = "Jag beklagar!";
"https://macitbetter.com/contact" = "mailto:betterzip@macitbetter.com";
"https://macitbetter.com/" = "https://macitbetter.com/";
"http://www.win-rar.com/" = "http://www.win-rar.com/";

/* helpers */
"Last modified: %@\nSize: %@" = "Senast ändrade: %@\nSize: %@";

/* ReplaceExistingFiles */
"An item named %@ already exists in this location. Do you want to replace it with the one you are extracting?" = "Ett objekt med namnet %@ finns redan på den här platsen. Vill du ersätta det med den du extraherar?";
"An item named %@ already exists in this location inside the archive. Do you want to replace it with the one you are adding?" = "Ett objekt med namnet %@ finns redan på den platsen inuti arkivet. Vill du ersätta det med det du lägger till?";
"File in archive:" = "Fil i arkivet:";
"File on disc:" = "Fil på skiva:";

/* ZipDocument */
"Zip Format (recommended)" = "Zip-format (rekommenderas)";
"TAR Format, uncompressed (tar)" = "TAR-format, okomprimerad (tar)";
"TAR Format, GZip compressed (tgz)" = "TAR-format, GZip komprimerad (tgz)"; 
"TAR Format, BZip2 compressed (tbz)" = "TAR-format, BZip2 komprimerad (tbz)";
"7-Zip Format (best compression)" = "7Zip-format (mest komprimering)";
"RAR Format" = "RAR-format";
"Extract All" = "Extrahera alla";
"Extract all files and folders from the archive" = "Extrahera alla filer och mappar från arkivet";
"Extract" = "Extrahera";
"Extract the selected files or folders from the archive" = "Extrahera de valda filerna eller mapparna från arkivet";
"Extracting archive: %@" = "Extraherar arkivet: %@";
"Opening archive with %d items. Ugh, this is going to take a while..." = "Öppnar arkivet med %d objekt. Huh, det kommer att ta ett tag...";
"Opening archive with %d items" = "Öppnar arkivet med %d objekt";
"Check for updates on startup?" = "Leta efter uppdateringar vid start?";
"Would you like %@ to check for updates on startup? You can initiate the check manually from the preferences window at any time." = "Vill du att %@ letar efter uppdatering vid start? Du kan själv leta manuellt från inställningsfönstret när du vill.";
"Yes" = "Ja";
"No" = "Nej";
"Are you sure you want to overwrite the original archive?" = "Är du säker på att du vill skriva över originalarkivet?";
"Warning: Saving cannot be undone" = "Varning: Sparningen kan inte återtas";
"Save" = "Spara";
"Don't Save" = "Spara inte";
"Saving archive: %@ of %@" = "Sparar arkivet: %@ av %@";
"Extracting items from archive: %@ of %@" = "Extraherar objekt från arkivet: %@ av %@";
"Add" = "Lägg till";
"Open" = "Öppna";
"Add Items" = "Lägg till objekt";
"Extract Here" = "Extrahera hit";
"Warning" = "Varning";
"%@ is not handled by any application. Try to extract the file and use Finder to open it." = "%@ hanteras inte av någon applikation. Försök att extrahera filen och öppna den i Finder.";
"OK" = "Okej";
"Delete Items" = "Radera objekt";
"You can't move an item into one of its subfolders!" = "Du kan inte flytta ett objekt till en av dess undermappar!";
"Move Items" = "Flytta objekt";
"BetterZip will now remove Mac specific files from the archive." = "BetterZip kommer nu att ta bort Mac-specifika filer från arkivet.";
"Clean now" = "Rensa nu";
"Cancel" = "Avbryt";
"Clean Archive" = "Rensa arkiv";
"Change Archive Mode" = "Byt arkiv läge";
"Archive" = "Arkivera";
"Add to %@..." = "Lägg till i %@...";
"Extract All..." = "Extrahera alla...";
"Extract Selected..." = "Extrahera valda...";
"Save the archive" = "Spara arkivet";
"Add a new file or folder to the archive" = "Lägg till en ny fil eller mapp till arkivet ";
"Extract files or folders from the archive" = "Extrahera filer eller mappar från arkivet";
"View" = "Visa";
"View the selected file" = "Visa vald fil";
"Delete" = "Radera";
"Delete the selected files or folders from the archive" = "Radera de valda filerna eller mapparna från arkivet";
"Search" = "Sök";
"Search the archive file" = "Sök i arkivet";
"Clean" = "Rensa";
"Stop" = "Stoppa";
"Ignore and go on" = "Ignorera och gå vidare";
"The file %@ could not be added to the archive. Maybe the system disc is full?" = "Filen %@ kunde inte läggas till i arkivet. Är systemdisken full kanske?";
"There is not enough free space on the destination drive." = "Deet finns inte tillräckligt med utrymme på måldisken.";
"Loading archive: %@" = "Laddar arkivet: %@";
"External command returned: %d\n" = "Externt kommando kom tillbaka: %d\n";
"Saving archive failed" = "Sparningen av arkivet misslyckades";
"You don't have permission to write to this folder." = "Du har inte behörighet att skriva till den här mappen.";
"An unknown error occurred." = "Ett okänt fel har inträffat.";
"New Folder" = "Ny mapp";
"Create New Folder" = "Skapa ny mapp";
"Error" = "Fel";
"Create a new folder in the selected place inside the archive." = "Skapa ny mapp på den valda platsen inuti arkivet.";
"An item with this name already exists in this folder!" = "Ett objekt med det namnet finns redan i den här mappen!";
"Do you want to save the changes you made in the document %@?" = "Vill du spara ändringarna du gjorde i dokumentet %@?";
"Your changes will be lost if you don't save them." = "Din ändringar försvinenr om du inte sparar dom.";
"The archive extraction failed." = "Extrahering av arkivet misslyckades.";
"Maybe, there is not enough free space on the destination drive. Or the password is incorrect." = "Kanske finns det inte tillräckligt med plats på måldisken. Eller så är lösenordet felaktigt.";
"Rename Item" = "Byt namn på objektet";
"Opening archive failed" = "Det gick inte att öppna arkivet";
"Not encrypted" = "Inte krypterad";
"Weak (PKZip2 compatible)" = "Svag (PKZip2 kompatibel)";
"Strong (AES-256)" = "Stark (AES-256)";
"untitled folder" = "Namnlös mapp";
"BetterZip Temporary Folder" = "BetterZips tillfälliga mapp"; 
"(incl. %d hidden)" = "(ink. %d dolda)";
"%d selected, uncompressed size: %@ %@" = "%d valda, okomprimerad storlek: %@ %@";
"%d items, uncompressed size: %@ %@" = "%d obbjekt, okomprimerad storlek: %@ %@";
"%d item, uncompressed size: %@ %@" = "%d objekt, okomprimerad storlek: %@ %@";
"BetterZip will now remove one file matching the patterns configured in the preferences window from the archive." = "BetterZip kommer nu att ta bort en fil, som matchar mönstret som är angivet i inställningarna, från arkivet.";
"BetterZip will now remove %d files matching the patterns configured in the preferences window from the archive." = "BetterZip kommer nu att ta bort %d filer, som matchar mönstret som är angivet i inställningarna, från arkivet.";
"BetterZip will now remove one Mac specific file from the archive." = "BetterZip kommer nu att ta bort en Mac-specifik fil från arkivet ";
"BetterZip will now remove %d Mac specific files from the archive." = "BetterZip kommer nu att ta bort %d Mac-specifika filer från arkivet ";
"Remove" = "Ta bort";
"BetterZip cannot extract to this folder. Maybe you don't have write access." = "BetterZip kan inte extrahera till denna mapp. Kanske har du inte skrivrättigheter.";
"Save As..." = "Spara som...";
"Save the archive with another name." = "Spara arkivet med ett annat namn.";
"Cleaning" = "Rensar";
"No compression" = "Ingen komprimering"; 
"Fast, but larger archives" = "Snabbt, men större arkiv";
"Normal" = "Normal";
"Best, but slower operation" = "Bäst, men tar längre tid";
"Remove files matching the patterns configured in the preferences window from the archive." = "Ta bort filer, som matchar mönstret som är angivet i inställningarna, från arkivet.";
"File Types" = "Fil-typer";
"N/A" = "Går inte";
"Multiple files" = "Flera filer";
"No files selected" = "Inga filer valda";
"A volume is missing: /%s." = "En volym saknas: /%s.";
"Close" = "Stäng";
"Strong (AES-256) with header encryption" = "Stark (AES-256) med kryptering av filhuvudet";


/* PreferenceController */
"Last checked: " = "Kollade sist: ";
"General" = "Allmänt";
"Columns" = "Kolumner";
"Advanced" = "Avancerat";
"Helpers" = "Hjälpredor";
"Use RAR" = "Använd RAR";
"Never" = "Aldrig";
"never" = "aldrig";
"Next to original" = "Intill originalet";


/* V 2.0 */
"Cancel the operation" = "Avbryt åtgärden";
"Reveal in Finder" = "Visa i Finder";
"Passwords" = "Lösenord";
"no errors" = "inga fel";
"with errors" = "med några fel";
"cancelled" = "avbruten";
"Extracted %@" = "Extraherade %@";
"Extracting %@" = "Exxtraherar %@";
"Compressing %@" = "Komprimerar %@";
"Extracting items temporarily" = "Extraherar objekt tillfälligt";
"%@ of %@" = "%@ av %@";
"%@ copy" = "%@ kopiera";
"Extract to..." = "Extrahera till...";
"The archive could not be extracted completely. It may be damaged." = "Arkivet kunde inte extraheras fullständigt. Det kan vara skadat.";
"This archive appears to be damaged." = "Det här arkivet verkar vara skadat.";
"The archive could not be extracted." = "Arkivet kunde inte extraheras.";
"It is either damaged or in an unsupported format." = "Det är antingen skadat eller är i ett format som inte stöds.";
"BetterZip Recovered Files" = "BetterZip-återskapade filer";
"Multiple Copies Installed" = "Flera kopior installerade";
"Quit and Reveal in Finder" = "Avsluta och visa i Finder";
"Queued for extraction" = "Köade för extrahering";
"Queued for compression" = "Köade för komprimering";
"The archive tests failed." = "Testning av arkivet misslyckades.";
"The archive is either damaged or in an unsupported format." = "Arkivet är antingen skadat eller är i ett format som inte stöds";
"Test" = "Testa";
"Testing: %@\n" = "Testar: %@\n";
"Test the archive" = "Testa arkivet";
"Running script" = "Kör skriptet";
"Show Favorites" = "Visa favoriter";
"Hide Favorites" = "Göm favoriter";
"Show Preview" = "Visa förhandsvisning";
"Hide Preview" = "Göm förhandsvisning";
"<new password>" = "<nytt lösenord>";
"The transcript window may contain further details." = "Logg-fönstret kan innehålla mer detaljer.";
"The file %@ has been modified." = "Filen %@ har ändrats.";
"Do you want to save the changes back to the archive?" = "Vill du spara ändringarna till arkivet?";
"Update File" = "Uppdatera fil";
"Ignore Changes" = "Ignoerar ändringarna";
"Ignore This Time" = "Ignorera den här gången";
"Symbolic Link (no preview possible)" = "Symbolisk länk (förhandsvisning inte möjligt)";
"Use for subsequent archives" = "Använd för nästkommande arkiv";
"Use this password for the new archive" = "Använd detta lösenord för det nya arkivet";
"This is not the password you are looking for." = "Det här är inte lösenordet du letar efter.";
"Edit Presets..." = "Redigera förinställningar...";
"Show save panel" = "Visa spara-panelen";
"XAR Format" = "XAR-format";
"Presets" = "Förinställningar";
"Testing archive %@" = "Testar arkivet %@";
"Archive test successful" = "Arkivtestet klart";
"The archive test was completed successfully." = "Arkivtestet framgångsrikt.";
"Today" = "Idag";
"Yesterday" = "Igår";
"Go to the win.rar GmbH web site" = "Gå till win.rar GmbHs hemsida";
"Extracting items from %@" = "Extraherar objekt från %@";
"The rar helper could not be found." = "RAR-hjälpredan kunde inte hittas.";
"Please set the correct path in Preferences > Helpers or choose a different format for saving." = "Vänligen välj rätt sökväg i Inställningar > Hjälpredor eller välj ett annat format för sparning.";
"Merge Folders" = "Slå ihop mappar";
"Keep Both" = "Behåll båda";
"Apply to all folders" = "Tillämpa på alla mappar";
"Apply to all" = "Tillämpa på alla";
"Do you want to extract the %d archives that were found inside the selected folders?" = "Vill du extrahera till %d arkiven som hittade i den valda mappen?";
"To ignore the selected folders and only extract directly selected archives click “Extract Selected Only”." = "För att ignorera de valda mapparna och börja extrahera bara de valda arkiven, klicka på \"Extrahera endast valda\"";
"Extract Selected Only" = "Extrahera endast valda";
"Archive Creation Complete" = "Arkivet skapades framgångsrikt";
"Archive Extraction Complete" = "Arkiv-extraheringen klar";
"All Queued Archive Operations Complete" = "All köade arkivåtgärder klara";
"<new preset>" = "<Ny förinställning>";
"Other folder..." = "Annan mapp...";
/* open with other application */
"Other..." = "Annan...";
"Compress" = "Komprimera";
"Saving archive %@" = "Sparar arkivet %@";
"Compressed %@" = "Komprimerade %@";
"An error occurred" = "Ett fel har uppstått";
"Use this preset as default in the toolbar" = "Använd den här förinställningen som förvald i verktygslisten";
"Use this preset as service" = "Använd denna förinställning som en tjänst";

/* added in BetterZip 3 */
"Adding files to archive %@" = "Lägger till filler i arkivet %@";
"When in Direct Mode, all archive operations are immediate and cannot be undone." = "När du är i Direktläge kommer alla arkivåtgärder ske på en gång och kan inte ångras.";

/* the two possible labels of the action button in the "file replace" alert panel */
"Update" = "Uppdatera";
"Replace" = "Ersätt";

"An item named %@ already exists in this location inside the archive. Do you want to update it?" = "Ett objekt med namnet %@ finns redan på den här platsen inuti arkivet. Vill du uppdatera det?";

"The archive cannot be created." = "Arkivet kunde inte skapas.";
"BetterZip will now remove one file matching your patterns from the archive." = "BetterZip kommer nu att ta bort en fil som matchar ditt mönster från arkivet.";
"BetterZip will now remove %d files matching your patterns from the archive." = "BetterZip kommer nu att ta bort %d files som matchar ditt mönster från arkivet.";
"After filtering, there are no files left to archive." = "Efter filtreringen så finns det inga filer kvar i arkivet.";
"macOS returned this error:" = "macOS skickade detta fel:";
"Use this pattern to specify which files and folders to add to the archive:" = "Använd detta mönster för att specificera vilka filer och mappar som ska läggas till i arkivet";
"Add Files to Archive" = "Lägg till filer i arkivet";
"Use this pattern to delete files and folders from the archive:" = "Använd detta mönster för att radera filer och mappar från arkivet:";
"Delete Files From Archive" = "Radera filer från arkiv";

/* displayed in the file types table for user defined extensions */
"<Click to add your own>" = "<Klicka för att lägga till dina egna>";

/* new compression levels */
"High, but slower operation" = "Hög, men långsammare åtgärd";
"Best (solid, slow extraction)" = "Bäst (Ordentlig, men långsam extrahering)";

/* Preferences window - name of the tab to manage filter patterns */
"Filtering" = "Filtrera";

/* Tooltip for the delete with pattern toolbar button */
"Delete with pattern" = "Radera enligt mönster";

"<new pattern>" = "<Nytt mönster>";

/* warning when a user adds an archive comment, but the current format doesn’t support that (user can still save with an other format */
"You should save this archive with ZIP or RAR format or your comment will be lost." = "DU bör spara detta arkiv med ZIP eller RAR, annars försvinner din kommentar.";

/* possible button labels for setting and clearing passwords in the save presets configuration */
"Set" = "Ställ in";
"Clear" = "Rensa";

"CPIO Format, uncompressed (cpio)" = "CPIO-format, okomprimerat (cpio)";
"TAR Format, xz compressed (txz)" = "TAR-format, xz komprimerat (txz)";

/* title of the OK button in the file open panel used to locate the temp folder or standard opening program */ 
"Use" = "Använd";

/* possible file status strings */
"Modified" = "Ändrad";
"Moved" = "Flyttad";
"Added" = "Tillagd";
"Updated" = "Uppdaterad";

"An error occurred opening %@. Do you want to try to open the archive anyway?" = "Ett fel uppstod vid öppnadet av %@. Vill du försöka öppna det i alla fall?";
"Cancel Opening" = "Avbryt öppnandet ";
"Open Anyway" = "Öppna i alla fall";

/* added in BetterZip 4 */

/* Default title for dynamic preset services */
"Compress with Preset %@" = "Komprimera med förinställningen %@";
"Extract with Preset %@" = "Extrahera med förinställningen %@";
"Service Name" = "Tjänstens namn";
"Comment Text" = "Kommentera text";

"Caution" = "Se upp";
"Do not enable this option, if you are not in the habit of making regular backups of your data. BetterZip will not warn you before overwriting files, if you use a preset with the overwrite switch enabled. Files can be lost. Use at your own risk." = "Aktivera inte denna inställning såvida du inte har för vana att regelbundet backa upp dina data. BetterZip kommer inte att varna innan filer skrivs över, om du använder en förinställning med överskrivning aktiverat. Filer kan gå förlorade. Används på egen risk.";
"Activate" = "Aktivera";
"Trash" = "Kasta";
"Don't move" = "Flytta inte";
"+pwd" = "+pwd";
"Reload Drop Bar" = "Ladda om Släpp-listen";

"The file %@ could not be extracted. %@\n\nThe last error macOS reported was:\n\"%s\"" = "Filen %@ kunde inte extraheras. %@\n\nDet sista felet macOS rapporterade var:\n\"%s\"";
"The password may be incorrect." = "Lösenordet kan vara felaktigt.";
"Archive Extraction Failed" = "Extrahering av arkivet misslyckades";
"Archive Creation Failed" = "Skapandet av arkivet misslyckades";
"Archive Test Successful" = "Arkivtestet var framgångsrikt";
"Archive Test Failed" = "Arkivtestet misslyckades ";

"The archive disappeared" = "Arkivet försvann";
"You can still browse the contents, but all archive operations will fail. \nDo you want to close the window?" = "Du kan fortfarande bläddra i innehållet, men alla arkivåtgärder kommer att misslyckas. \nVill du stänga fönstret?";
"Ignore" = "Ignorera";

"An error occurred opening %@. Do you want to try to repair the archive?" = "Ett fel inträffade vid öppning %@. Vill du försöka reparera arkivet?";
"The archive could not be extracted completely. It may be damaged. Do you want to try to repair the archive?" = "Arkivet kunde inte extraheras fullständigt. Det kan vara skadat. Vill du försöka reparera det?";
"Repair" = "Reparera";
"%@ (damaged)" = "%@ (skadat)";

"Drag items here to compress or extract" = "Dra objekt hit för att komprimera eller extrahera";
"Drop archives here to extract" = "Släpp arkiv här för att extrahera";
"Drop the archives here to open them" = "Släpp arkiv här för att öppna dom";
"Drop items here to compress" = "Släpp objekt här för att komprimera";
"Drop the files here to add them to a new archive" = "Släpp filer här för att lägga till dom till det nya arkivet";
"Choose from your favorite presets" = "Välj bland din favoritförinställningar";
"Test the archive integrity" = "Testa arkivets integritet";
"Open and browse the archive" = "Öppna och bläddra i arkivet";
"Add the items to a new archive" = "Lägg till objekt till det nya arkivet";
"Trash" = "Kasta";

"Compress with BetterZip" = "Komprimera med BetterZip";
"Extract with BetterZip" = "Extrahera med BetterZip";

"Reveal in Finder" = "Visa i Finder";
"Cancel the operation" = "Avbryt åtgärden";

"This archive doesn't contain any Mac specific files yet" = "Det här arkivet innehåller inga Macspecifika filer ännu";
"Do you want to keep it that way or add metadata to your archive?" = "Vill du låta arkivet vara så här eller vill du lägga till metadata ditt arkiv?";
"Add Mac Stuff" = "Lägg till Macsaker";
"Keep Mac Stuff out" = "Utelämna Macsaker";

"System Default" = "Systemförinställningar";
"One password per line:" = "Ett lösenord per rad:";
"Back" = "Återgå";
"Unlock Password Manager…" = "Lås upp lösenordshanteraren…";
"Lock Password Manager" = "Lås lösenordshanteraren";
"Archives" = "Arkiv";
"Archive Types" = "Arkivtyper";
"Files" = "Filer";
"Next to archive" = "Nästa till arkivet";
"Choose Master Password" = "Välj huvudlösenord";
